EDT/УТ/src/DataProcessors/ОтчетПоГруппамРайонов/ОтчетПоГруппамРайонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОтчетПоГруппамРайонов</name>
</mdclass:DataProcessor>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/новаГеоРайоны/новаГеоРайоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаГеоРайоны</name>
  <owners>Catalog.новаКлассификаторРайонов</owners>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ребра</name>
    <attributes>
      <name>Широта1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ОтчетПоГруппамРайонов/ObjectModule.bsl
Функция Сформировать(Таб, НачПериода, КонПериода, ГруппаРайонов) Экспорт
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	ЗакрытыеЗаказы.Доставка,
	            |	ЗакрытыеЗаказы.ИнтернетМагазин КАК ИнтернетМагазин,
	            |	ЗакрытыеЗаказы.Доставка.ТочкаПрибытия.Москва КАК ЭтоМосква,
	            |	ЗакрытыеЗаказы.Доставка.ТочкаПрибытия.Адрес.Широта КАК Широта,
	            |	ЗакрытыеЗаказы.Доставка.ТочкаПрибытия.Адрес.Долгота КАК Долгота
	            |ИЗ
	            |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	            |ГДЕ
	            |	ЗакрытыеЗаказы.СтатусИнтернетМагазина.Ссылка = ЗНАЧЕНИЕ(Справочник.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт)
	            |	И ЗакрытыеЗаказы.Период МЕЖДУ &НачДата И &КонДата
	            |	И ЗакрытыеЗаказы.ТипЗаказа.Ссылка = ЗНАЧЕНИЕ(Перечисление.ТипыЗаказов.Доставка)
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	ИнтернетМагазин";
				
	Зап.УстановитьПараметр("НачДата", НачалоДня(НачПериода));			
	Зап.УстановитьПараметр("КонДата", КонецДня(КонПериода));
	
	Рез = зап.Выполнить().Выгрузить();
	Для каждого Тек Из Рез Цикл
		Нов = Таб.Добавить();
		Нов.Контрагент = Тек.ИнтернетМагазин;
		Если Тек.ЭтоМосква Тогда
			Нов.Москва = 1;
		ИначеЕсли Справочники.новаГеоРайоны.ОпределениеПринадлежностиКГруппеРайонов(ГруппаРайонов, Тек.Широта, Тек.Долгота) Тогда
			Нов.Бетонка = 1;
		Иначе	
			Нов.Прочее = 1;
		КонецеСли;	
	КонецЦикла;	
	
	Таб.Свернуть("Контрагент", "Москва, Бетонка, Прочее");
	Таб.Сортировать("Контрагент");
	  
КонецФункции
